In [1]:
import numpy as np
import pandas as pd

In [4]:
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
print('PREVIOUS_MAX_ROWS ',PREVIOUS_MAX_ROWS)
pd.options.display.max_rows = 20
np.random.seed(123)

PREVIOUS_MAX_ROWS  60

In [5]:
CURRENT_MAX_ROWS = pd.options.display.max_rows
print('CURRENT_MAX_ROWS ',CURRENT_MAX_ROWS)

CURRENT_MAX_ROWS  20

In [6]:
import matplotlib.pyplot as plt

In [10]:
plt.rc('figure',figsize=(10,6))
np.set_printoptions(precision=4, suppress=True)

In [11]:
#Handling Missing Data

In [12]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
print(string_data)
string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

In [19]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [20]:
string_data.isna()

0     True
1    False
2     True
3    False
dtype: bool

In [18]:
from numpy.random import randn as rn
np.random.seed(101)
matrix_data=rn(5,4)
matrix_data

array([[ 2.7068,  0.6281,  0.908 ,  0.5038],
       [ 0.6511, -0.3193, -0.8481,  0.606 ],
       [-2.0182,  0.7401,  0.5288, -0.589 ],
       [ 0.1887, -0.7589, -0.9332,  0.9551],
       [ 0.1908,  1.9788,  2.606 ,  0.6835]])

In [21]:
# Filtering Out Missing Data

In [22]:
from numpy import nan as NA

In [30]:
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [24]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.dropna(inplace=True)

In [27]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [33]:
data[~data.isnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [36]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [41]:
cleaned = data.dropna()
print('Cleaned DataFrame\n','-'*20,'\n',cleaned,'\n')
print('Original DataFrame\n','-'*20,'\n',data)

Cleaned DataFrame
 --------------------
      0    1    2
0  1.0  6.5  3.0

Original DataFrame
 --------------------
      0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [42]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [44]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [45]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [46]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [47]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.302665  1.693723 -1.706086
1 -1.159119 -0.134841  0.390528
2  0.166905  0.184502  0.807706
3  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [48]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA

In [49]:
df

          0         1         2
0  0.302665       NaN       NaN
1 -1.159119       NaN       NaN
2  0.166905       NaN  0.807706
3  0.072960       NaN  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [50]:
df.dropna()

          0         1         2
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [51]:
df.dropna(thresh=2)

          0         1         2
2  0.166905       NaN  0.807706
3  0.072960       NaN  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [52]:
# Filling In Missing Data

In [54]:
df.fillna(value=0)

          0         1         2
0  0.302665  0.000000  0.000000
1 -1.159119  0.000000  0.000000
2  0.166905  0.000000  0.807706
3  0.072960  0.000000  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [55]:
df.fillna(value={1:0.5,2:0}) # First Column NA values were filled by 0.5, 2nd column NA values were filled by 0

          0         1         2
0  0.302665  0.500000  0.000000
1 -1.159119  0.500000  0.000000
2  0.166905  0.500000  0.807706
3  0.072960  0.500000  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [56]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0  0.302665  0.000000  0.000000
1 -1.159119  0.000000  0.000000
2  0.166905  0.000000  0.807706
3  0.072960  0.000000  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [58]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0 -0.732845 -1.382920  1.482495
1  0.961458 -2.141212  0.992573
2  1.192241       NaN  1.292765
3 -1.467514       NaN -0.162535
4  0.485809       NaN       NaN
5 -0.855196       NaN       NaN

In [62]:
df.fillna(method='ffill')

          0         1         2
0 -0.732845 -1.382920  1.482495
1  0.961458 -2.141212  0.992573
2  1.192241 -2.141212  1.292765
3 -1.467514 -2.141212 -0.162535
4  0.485809 -2.141212 -0.162535
5 -0.855196 -2.141212 -0.162535

In [63]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.732845 -1.382920  1.482495
1  0.961458 -2.141212  0.992573
2  1.192241 -2.141212  1.292765
3 -1.467514 -2.141212 -0.162535
4  0.485809       NaN -0.162535
5 -0.855196       NaN -0.162535

In [64]:
data = pd.Series([1.,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [65]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [66]:
#Removing Duplicate

In [69]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [78]:
data.groupby(by=['k1']).k1.count()

k1
one    3
two    4
Name: k1, dtype: int64

In [79]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [80]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [81]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [83]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [85]:
data.drop_duplicates(['k1'],keep='first')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [86]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [87]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [89]:
# Transforming data using Lambda Function

In [90]:
data = pd.DataFrame({'Food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                    'Ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          Food  Ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [91]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [95]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [96]:
lowercased = data['Food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: Food, dtype: object

In [97]:
data['animal'] = lowercased.map(meat_to_animal)

In [98]:
data

          Food  Ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [100]:
data['Food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: Food, dtype: object

In [101]:
#Replacing values in place of missing values